Revit 2027 API
Group.GetMemberIds Method
Retrieves all the member ElementIds of the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetMemberIds()
Public Function GetMemberIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetMemberIds()
member GetMemberIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
An ordered list of the members within the group. The order of this list can be used to match members between other instances of the group.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace